app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
def index
	# provide a list of authors to the view for the filter control
	@authors = Author.all

	# filter the @posts list based on user input
	if !params[:author].blank?
	  @posts = Post.by_author(params[:author])
	elsif !params[:date].blank?
	  if params[:date] == "Today"
		@posts = Post.from_today
	  else
		@posts = Post.old_news
	  end
	else
	  # if no filters are applied, show all posts
	  @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "testing the MVC out on this piece!!"], ["updated_at", "2020-09-08 17:11:48.207009"], ["id", 1]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))